In [1]:
import pandas as pd

In [2]:
list1 =[5,4,7]

In [3]:
df = pd.DataFrame(list1)

In [4]:
df

   0
0  5
1  4
2  7

In [5]:
df1 = pd.read_csv("employee2.csv")

In [6]:
df1

   eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0
6    7    Shalu  20.0

In [7]:
df1.shape

(7, 3)

In [8]:
df1.columns

Index(['eno', 'ename', 'age'], dtype='object')

In [9]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
df1.dtypes

eno        int64
ename     object
age      float64
dtype: object

In [11]:
df1

   eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0
6    7    Shalu  20.0

In [12]:
df.head(6)

   0
0  5
1  4
2  7

In [13]:
df1.head(6)

   eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0

In [14]:
df1.tail(2)

   eno  ename   age
5    6   sonu  33.0
6    7  Shalu  20.0

In [15]:
df1.info

<bound method DataFrame.info of    eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0
6    7    Shalu  20.0>

In [16]:
df1

   eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0
6    7    Shalu  20.0

In [17]:
df1.info

<bound method DataFrame.info of    eno    ename   age
0    1    nitya  20.0
1    2  namasvi  21.0
2    3     sonu  33.0
3    4    vidya  20.0
4    5    kaira   NaN
5    6     sonu  33.0
6    7    Shalu  20.0>

In [18]:
df1['ename']

0      nitya
1    namasvi
2       sonu
3      vidya
4      kaira
5       sonu
6      Shalu
Name: ename, dtype: object

In [20]:
df1[['age','ename']]

    age    ename
0  20.0    nitya
1  21.0  namasvi
2  33.0     sonu
3  20.0    vidya
4   NaN    kaira
5  33.0     sonu
6  20.0    Shalu

In [24]:
df1.iloc[2,2]

np.float64(33.0)